package com.softserve.edu.teachua.data;

public enum ClubContents {
    IT_EDUCATION_CLUB(Cities.KYIV_CITY, "IT освіта: курси \"ГРАНД\"", "Ми вивчаємо все, що можна уявити в ІТ"),
    AMERICAN_CLUB(Cities.KYIV_CITY, "American Gymnastics Club", "Американський гімнастичний клуб (American Gymnastics Club)"),
    NESAMOVITI_CLUB(Cities.KYIV_CITY, "Студія танцю \"Несамовиті\"", " Студія сучасного танцю «Несамовиті» для дітей віком від 3 - х років"),
    LESKIV_CLUB(Cities.KYIV_CITY, "LESKIV-SCHOOL", "Спорт - гірські та водні лижі, водні лижі та вейкборд, ролики, петанк"),
    MISOGI_CLUB(Cities.KYIV_CITY, "Професійний клуб Айкідо Йошинкан в Києві - MISOGI", "Філософія Айкідо — відсутність агресії, відновлення гармонії в навколишньому світі"),
    DREAM_TEAM_CLUB(Cities.KYIV_CITY, "Школа танців Dream Team", "Професійні хореографи у різних танцювальних стилях"),
    NEW_CADRE_CLUB(Cities.HARKIV_CITY, "Новий Кадр", "Новий кадр — це справжній творчий майданчик"),
    VECTOR_CLUB(Cities.HARKIV_CITY, "Центр позашкільної освіти \"ВЕКТОР\" Харківської міської ради", "Центр пропонує заняття у гуртках"),
    SPORT_SCHOOL_1_CLUB(Cities.HARKIV_CITY, "Комунальний заклад \"Комплексна дитячо-юнацька спортивна школа № 1 Харківської міської ради\"", "Спортивна школа пропонує заняття такими видами спорту"),
    SPORT_SCHOOL_2_CLUB(Cities.HARKIV_CITY, "Комплексна дитячо-юнацька спортивна школа №2 Харківської міської ради", "В КДЮСШ №2 культивуються такі види спорту"),
    CREATIVITY_CENTER_1_CLUB(Cities.HARKIV_CITY, "Комунальний заклад \"Центр дитячої та юнацької творчості № 1 Харківської міської ради\"", "Центр працює за такими напрямками"),
    SAILORS_CLUB(Cities.HARKIV_CITY, "Комунальний заклад \"Харківський дитячо-юнацький клуб моряків Харківської міської ради\"", "Комунальний заклад ''Харківський дитячо-юнацький клуб моряків Харківської міської ради''"),
    CREATIVITY_CENTER_6_CLUB(Cities.HARKIV_CITY, "Комунальний заклад \"Центр дитячої та юнацької творчості №6 Харківської міської ради\"", "Заклад пропонує заняття у таких гуртках"),
    SPORT_SCHOOL_16_CLUB(Cities.HARKIV_CITY, "Комунальний заклад \"Комплексна дитячо-юнацька спортивна школа № 16 Харківської міської ради\"", "Спортивна школа пропонує заняття з боксу, спортивної та художньої гімнастики"),
    VECTOR_CENTER_CLUB(Cities.HARKIV_CITY, "Центр позашкільної освіти \"ВЕКТОР\" Харківської міської ради", "Центр пропонує заняття у гуртках: авіамоделювання"),
    PLASTUN_KHARAKTER_CLUB(Cities.ODESA_CITY, "Козацький клуб \"Пластун-Характер\"", "Напрями навчання: - слов'янський рукопашний бій (напрямок-пластуни)"),
    ROBOTICS_CENTER_CLUB(Cities.ODESA_CITY, "Центр робототехніки \"Boteon\"", "Навчальний центр ''Boteon Education'' має філії і представництва в 6 містах України"),
    MUSIC_SCHOOL_15_CLUB(Cities.ODESA_CITY, "Дитяча музична школа №15 ім. Т. І. Бойового", "Програми навчання: класи: фортепіано; струнно-смичкових інструментів (віолончель, скрипка); класичної гітари"),
    ART_SCHOOL_2_CLUB(Cities.ODESA_CITY, "Дитяча художня школа №2 м.Одеси", "Комунальний позашкільний навчальний заклад дитяча художня №2 м.Одеси"),
    ART_SCHOOL_10_CLUB(Cities.ODESA_CITY, "Мистецька школа № 10 м.Одеси", "Комунальний заклад початкової спеціалізованої освіти ''Мистецька школа № 10 м.Одеси''"),
    ART_SCHOOL_16_CLUB(Cities.ODESA_CITY, "Дитяча школа мистецтв №16 м.Одеси", "Комунальний позашкільний навчальний заклад ''Дитяча школа мистецтв №16 м.Одеси''"),
    ART_SCHOOL_8_CLUB(Cities.ODESA_CITY, "Мистецька школа № 8 м. Одеси", "Комунальний заклад початкової спеціалізованої освіти ''Мистецька школа № 8 м.Одеси''"),
    CENTER_NO3_CLUB(Cities.DNIPRO_CITY, "Комунальний позашкільний навчальний заклад \"Центр позашкільної роботи №3\" Дніпровської міської ради", "Центр охоплює до 30-ти гуртків в таких напрямках роботи"),
    MUSIC_SCHOOL_NO6_CLUB(Cities.DNIPRO_CITY, "Дніпровська дитяча музична школа №6 імені В.І.Скуратовського", "Ціль навчання в музичній школі - створення умов для розвитку творчих, інтелектуальних здібностей учнів, підтримка талановитих та обдарованих дітей"),
    SCIENCE_TECH_CENTER_CLUB(Cities.DNIPRO_CITY, "Комунальний позашкільний навчальний заклад \"Дніпропетровський обласний центр наукової–технічної творчості та інформаційних технологій учнівської молоді\"", "Центр пропонує позашкільне навчання"),
    PALACE_OF_CREATIVITY_CLUB(Cities.DNIPRO_CITY, "Комунальний позашкільний навчальний заклад \"Палац творчості дітей та юнацтва\"", "Центр пропонує навчання на гуртках за такими напрямками: художньо-естетичний"),
    JUNIOR_TECH_STATION_CLUB(Cities.DNIPRO_CITY, "Комунальний позашкільний навчальний заклад \"Міська станція юних техніків\"", "Позашкільна технічна освіта Дніпра"),
    CREATIVITY_CENTER_CLUB(Cities.DNIPRO_CITY, "Комунальний позашкільний навчальний заклад \"Центр дитячої та юнацької творчості\" ДМР", "Колективи КПНЗ «Центр дитячої та юнацької творчості» ДМР активно розвивають творчі здібності дітей"),
    UMNICHKA_CENTER(Cities.DNIPRO_CITY, "Дитячий центр \"Умнічка\"", "Центр раннього розвитку, та підготовки до школи"),
    AIKIKAI_AIKIDO_FEDERATION(Cities.DNIPRO_CITY, "Дніпровська федерація Айкікай Айкідо", "Занурюючи дитину в світ Айкідо, ви створюєте умови, що сприяють розвитку у ній таких якостей як доброта у поєднанні з волею"),
    SPAS_YAR_CENTER(Cities.ZAPORIZHZHIA_CITY, "Козацький спортивний центр \"Спас Яр\"", "Виховуємо козаків воїнів, патріотів української землі"),
    ZAPORIZHSKA_SICH_COMPLEX(Cities.ZAPORIZHZHIA_CITY, "Запорізький навчально-виховний комплекс \"Запорізька січ\"", "Запорізький навчально-виховний комплекс “Запорізька Січ” військово-спортивного профілю Запорізької міської ради Запорізької області"),
    ZAVODSKOY_BDUT_CENTER(Cities.ZAPORIZHZHIA_CITY, "Позашкільний навчальний заклад \"Будинок дитячої та юнацької творчості Заводського району\" Запорізької міської ради Запорізької області", "ПНЗ «БДЮТ Заводського району» розташований в індустріальному районі міста Запоріжжя"),
    SHEVCHENKIVSKYI_CDUT_CENTER(Cities.ZAPORIZHZHIA_CITY, "Позашкільний навчальний заклад \"Центр дитячої та юнацької творчості Шевченківського району\" Запорізької міської ради Запорізької області", "У 2020 — 2021 навчальному році у ПНЗ «ЦДЮТ Шевченківського району»"),
    HORTYTSKYI_AESTHETIC_EDUCATION_CENTER(Cities.ZAPORIZHZHIA_CITY, "Позашкільний навчальний заклад \"Центр естетичного виховання Хортицького району\" Запорізької міської ради Запорізької області", "Заклад пропонує навчання за напрямками"),
    OLEKSANDRIVSKYI_CREATIVE_CENTER(Cities.ZAPORIZHZHIA_CITY, "Позашкільний навчальний заклад \"Центр творчості дітей та юнацтва Олександрівського району\" Запорізької міської ради Запорізької області", "Заклад пропонує заняття в 34-х гуртках за напрямками"),
    SHEVCHENKIVSKYI_GIFTED_YOUTH_CENTER(Cities.ZAPORIZHZHIA_CITY, "Позашкільний навчальний заклад «Центр по роботі з обдарованою молоддю на базі закладів освіти Шевченківського району» Запорізької міської ради Запорізької області", "Заклад пропонує 3 гуртки (20 груп)"),
    ZAPORIZHIA_BOTANICAL_GARDEN(Cities.ZAPORIZHZHIA_CITY, "Позашкільний навчальний заклад \"Дитячий парк \" Запорізький міський ботанічний сад\" Запорізької міської ради Запорізької області", "У 2019-2020 н.р у закладі працюють 23 гуртки та творчі об’єднання за напрями");

    private final Cities city;
    private final String clubName;
    private final String descriptions;

    ClubContents(Cities city, String clubName, String descriptions) {
        this.city = city;
        this.clubName = clubName;
        this.descriptions = descriptions;
    }

    public Cities getCity() {
        return city;
    }

    public String getClub() {
        return clubName;
    }

    public String getDescriptions() {
        return descriptions;
    }

    @Override
    public String toString() {
        return String.format("ClubContents{city=%s, title='%s', descriptions='%s'}",
                city, clubName, descriptions);
    }
}
